app/views/home/index.html.erb

SELECT "projects".* FROM "projects" ORDER BY "projects"."id" ASC
---
			<span>
			 	<%= select_tag(:project_id, options_from_collection_for_select(Project.all.order(:id), :id, :name,params[:project_id]),class:"input_box_style", prompt: "all") %>