app/controllers/home_controller.rb

  def index
    proj_id = params[:project_id].to_i
    @tasks = Task.find_user_tasks(current_user,proj_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND (project_id = 1)  [["user_id", 2]]