app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 LIMIT $2 OFFSET $3  [["project_id", 1], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 1]]
---
  def index
    @tasks = @project.tasks
    respond_to do |format|
      format.html {@tasks = @tasks.paginate(:page => params[:page], :per_page => 2)}

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @project = Project.find_by_id(@task.project_id)

INSERT INTO "tasks" ("name", "description", "time_taken", "user_id", "project_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @task = Task.new(task_params.merge(:user_id => current_user.id))
    if @task.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_project
    @project = Project.find_by_id(params[:project_id])